org/CSS3简明总结.org
#+SETUPFILE: ../theme-rose.setup
#+DATE: <2020-11-10 二>
#+TITLE: CSS3简明总结

* 前言
  CSS 全称为 层叠样式表，其作用是对HTML标签添加样式、布局网页、添加动画效果。
  目前主流的 CSS版本是 CSS3。
* 入门
** 引入CSS的三种方式
*** 引入外部CSS文件
    这种方式优先级最低，但是便于管理
    #+begin_src html
      <html>
          <body>
              <head>
                  <!-- 引入外部CSS文件 -->
                  <link rel="stylesheet" type="text/css" href="path_to/style.css" />
              </head>
          </body>
      </html>
    #+end_src
*** 块级样式
    这种方式的优先级为中级，但是直接将样式表放在HTML文件内管理起来不方便。
    #+begin_src html
      <html>
          <style type="text/css">
           p{
               color: red;
           }
          </style>
          <body>
              <p>块级样式</p>
          </body>
      </html>
    #+end_src
*** 行内样式
    优先级最高。
    #+begin_src html
      <html>
          <body>
              <p style="color: red;">行内样式</p>
          </body>
      </html>
    #+end_src
** 优先级
*** important标记
    不同引入CSS代码的方式会有不同的优先级别。
    如果想要优先级可以对属性添加特定标记。
    #+begin_src html
      <html>
          <style type="text/css">
           p{
               /* 如果没有此标记yello将会被red覆盖。 */
               color: yellow !important;
               color: red;
           }
          </style>
          <body>
              <p>测试</p>
          </body>
      </html>
    #+end_src
*** 样式继承
    一些标签拥有父子级关系，所以其部分样式属性会随之继承，但也只是部分的如果想要指定某些样式属性被继承那么可以做 ~inherit~ 标记。
    #+begin_src html
      <html>
          <style type="text/css">
           p{
               color: red;
           }
          </style>
          <body>
            <p>
              <strong>
                <!-- strong标签继承了p标签的字体颜色 -->
                hello
              </strong>
            </p>
      
            <p style="border: 2px solid orange">
              <!-- 指定强制继承父类border属性效果。 -->
              <strong style="border: inherit">
                world
              </strong>
            </p>
          </body>
      </html>
    #+end_src
** 注释
   CSS文件的注释语法是 ~/* */~
* 选择器
  选择器也就是让CSS样式应用于特定标签的规则。
** 元素选择器
   通过标签名选择HTML对象
   #+begin_src html
     <html>
       <style type="text/css">
         /* 选中所有p标签 */
          p{
              color: red;
          }
          /* 选中div标签内的p标签 */
          div p{
              color: green;
          }
         </style>
         <body>
           <p>p1 ~</p>
           <div>
             <p>p2 ~</p>
             <p>p3 ~</p>
           </div>
         </body>
     </html>
   #+end_src
