CSS3简明总结.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-11-12 四 01:56 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>CSS3简明总结</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Evan Meek">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" href="/css/animate.min.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">CSS3简明总结</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org151f4f9">前言</a></li>
<li><a href="#org26dee03">入门</a>
<ul>
<li><a href="#org126da64">引入CSS的三种方式</a>
<ul>
<li><a href="#orgbd38bec">引入外部CSS文件</a></li>
<li><a href="#orgca8e026">块级样式</a></li>
<li><a href="#org433aba0">行内样式</a></li>
</ul>
</li>
<li><a href="#org8d56c92">优先级</a>
<ul>
<li><a href="#orgae70aeb">important标记</a></li>
<li><a href="#orgc76722a">样式继承</a></li>
</ul>
</li>
<li><a href="#orgf398222">注释</a></li>
</ul>
</li>
<li><a href="#org54391ec">选择器</a>
<ul>
<li><a href="#orgff4d5b3">元素选择器</a></li>
<li><a href="#org32fd13d">ID选择器</a></li>
<li><a href="#org3b3cb4c">属性选择器</a></li>
<li><a href="#orgbaea56e">合并选择</a></li>
<li><a href="#orgc2ed099">子类选择器</a></li>
<li><a href="#org218a4e7">子类过滤器</a></li>
<li><a href="#org70bde35">星号选择器</a></li>
</ul>
</li>
<li><a href="#org1232aca">颜色</a>
<ul>
<li><a href="#orgce42bc3">定义颜色的三种方式</a></li>
</ul>
</li>
<li><a href="#org35576d3">单位</a>
<ul>
<li><a href="#org234150f">px</a></li>
<li><a href="#org848784c">%</a></li>
<li><a href="#orgc2ffc37">em</a></li>
<li><a href="#org5d587fd">rem</a></li>
<li><a href="#org7ebfb33">小节</a></li>
</ul>
</li>
<li><a href="#org8786a85">字体</a></li>
<li><a href="#orgf7fe6b7">文本</a>
<ul>
<li><a href="#orgdcf7f40">首行缩进</a></li>
<li><a href="#org96691d1">划线</a></li>
<li><a href="#org4e1cb1a">文本对齐</a></li>
<li><a href="#org78110ca">行高</a></li>
<li><a href="#org5036fa5">间距</a></li>
<li><a href="#orge2cf13d">换行</a></li>
<li><a href="#org3dac411">阴影</a></li>
</ul>
</li>
<li><a href="#org001be59">光标</a></li>
<li><a href="#org55b2967">盒子模型</a>
<ul>
<li><a href="#orgb2ffef3">元素形态</a></li>
<li><a href="#org69f97c1">修改元素形态</a></li>
<li><a href="#org8264ed3">盒子大小</a></li>
<li><a href="#org6d5744f">盒子溢出内容处理方式</a></li>
<li><a href="#org7bdd714">占位</a></li>
<li><a href="#org8f4a95f">box-sizing</a></li>
<li><a href="#orgf8b52f3">content-box</a></li>
</ul>
</li>
<li><a href="#org2e6b0bb">边框</a>
<ul>
<li><a href="#org2305b8e">简单的边框</a></li>
<li><a href="#org6abc990">圆角</a></li>
<li><a href="#org2394696">轮廓</a></li>
<li><a href="#org00aabee">阴影</a></li>
</ul>
</li>
<li><a href="#org79c4e63">边距</a>
<ul>
<li><a href="#org3c6df6f">外边距</a></li>
<li><a href="#orgf2d26e1">内边距</a></li>
</ul>
</li>
<li><a href="#org7c14f1b">列表</a>
<ul>
<li><a href="#orga498f9d">符号样式</a></li>
<li><a href="#orga869abe">符号位置</a></li>
</ul>
</li>
<li><a href="#org95c2d4d">表格</a>
<ul>
<li><a href="#orgdeeee3c">表格间距</a></li>
<li><a href="#orgf2c4abb">表格间距合并</a></li>
<li><a href="#orgec281a3">垂直高度</a></li>
<li><a href="#org1c7c332">比例分布</a></li>
</ul>
</li>
<li><a href="#org8abe663">背景</a>
<ul>
<li><a href="#org0989da9">背景颜色</a></li>
<li><a href="#org23dc64d">背景图片</a></li>
<li><a href="#org6f0de40">重复背景图片</a></li>
<li><a href="#org7bdb2b8">图片尺寸</a></li>
<li><a href="#org601b74e">图片位置</a></li>
<li><a href="#org05c7302">固定背景位置</a></li>
<li><a href="#org7f3a5f5">简写background</a></li>
</ul>
</li>
<li><a href="#org5ab0143">效果</a>
<ul>
<li><a href="#org7e18587">透明</a></li>
<li><a href="#org3397471">渐变</a></li>
<li><a href="#org5161d18">变形</a></li>
<li><a href="#orgf4b7ee7">动画</a></li>
</ul>
</li>
<li><a href="#org0dc4497">浮动</a></li>
</ul>
</div>
</div>

<div id="outline-container-org151f4f9" class="outline-2">
<h2 id="org151f4f9">前言</h2>
<div class="outline-text-2" id="text-org151f4f9">
<p>
CSS 全称为 层叠样式表，其作用是对HTML标签添加样式、布局网页、添加动画效果。
目前主流的 CSS版本是 CSS3。
</p>
</div>
</div>
<div id="outline-container-org26dee03" class="outline-2">
<h2 id="org26dee03">入门</h2>
<div class="outline-text-2" id="text-org26dee03">
</div>
<div id="outline-container-org126da64" class="outline-3">
<h3 id="org126da64">引入CSS的三种方式</h3>
<div class="outline-text-3" id="text-org126da64">
</div>
<div id="outline-container-orgbd38bec" class="outline-4">
<h4 id="orgbd38bec">引入外部CSS文件</h4>
<div class="outline-text-4" id="text-orgbd38bec">
<p>
这种方式优先级最低，但是便于管理
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
    &lt;<span style="color: #ECA964;">body</span>&gt;
        &lt;<span style="color: #ECA964;">head</span>&gt;
            <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#24341;&#20837;&#22806;&#37096;CSS&#25991;&#20214; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
            &lt;<span style="color: #ECA964;">link</span> <span style="color: #31C6FF;">rel</span>=<span style="color: #10CFC0;">"stylesheet"</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span> <span style="color: #31C6FF;">href</span>=<span style="color: #10CFC0;">"path_to/style.css"</span> /&gt;
        &lt;/<span style="color: #ECA964;">head</span>&gt;
    &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgca8e026" class="outline-4">
<h4 id="orgca8e026">块级样式</h4>
<div class="outline-text-4" id="text-orgca8e026">
<p>
这种方式的优先级为中级，但是直接将样式表放在HTML文件内管理起来不方便。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
    &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
     p{
         color: red;
     }
    &lt;/<span style="color: #ECA964;">style</span>&gt;
    &lt;<span style="color: #ECA964;">body</span>&gt;
        &lt;<span style="color: #ECA964;">p</span>&gt;&#22359;&#32423;&#26679;&#24335;&lt;/<span style="color: #ECA964;">p</span>&gt;
    &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org433aba0" class="outline-4">
<h4 id="org433aba0">行内样式</h4>
<div class="outline-text-4" id="text-org433aba0">
<p>
优先级最高。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
    &lt;<span style="color: #ECA964;">body</span>&gt;
        &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"color: red;"</span>&gt;&#34892;&#20869;&#26679;&#24335;&lt;/<span style="color: #ECA964;">p</span>&gt;
    &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8d56c92" class="outline-3">
<h3 id="org8d56c92">优先级</h3>
<div class="outline-text-3" id="text-org8d56c92">
</div>
<div id="outline-container-orgae70aeb" class="outline-4">
<h4 id="orgae70aeb">important标记</h4>
<div class="outline-text-4" id="text-orgae70aeb">
<p>
不同引入CSS代码的方式会有不同的优先级别。
如果想要优先级可以对属性添加特定标记。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
    &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
     p{
         /* &#22914;&#26524;&#27809;&#26377;&#27492;&#26631;&#35760;yello&#23558;&#20250;&#34987;red&#35206;&#30422;&#12290; */
         color: yellow !important;
         color: red;
     }
    &lt;/<span style="color: #ECA964;">style</span>&gt;
    &lt;<span style="color: #ECA964;">body</span>&gt;
        &lt;<span style="color: #ECA964;">p</span>&gt;&#27979;&#35797;&lt;/<span style="color: #ECA964;">p</span>&gt;
    &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc76722a" class="outline-4">
<h4 id="orgc76722a">样式继承</h4>
<div class="outline-text-4" id="text-orgc76722a">
<p>
一些标签拥有父子级关系，所以其部分样式属性会随之继承，但也只是部分的如果想要指定某些样式属性被继承那么可以做 <code>inherit</code> 标记。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
    &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
     p{
         color: red;
     }
    &lt;/<span style="color: #ECA964;">style</span>&gt;
    &lt;<span style="color: #ECA964;">body</span>&gt;
      &lt;<span style="color: #ECA964;">p</span>&gt;
        &lt;<span style="color: #ECA964;">strong</span>&gt;
          <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">strong&#26631;&#31614;&#32487;&#25215;&#20102;p&#26631;&#31614;&#30340;&#23383;&#20307;&#39068;&#33394; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
          hello
        &lt;/<span style="color: #ECA964;">strong</span>&gt;
      &lt;/<span style="color: #ECA964;">p</span>&gt;

      &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"border: 2px solid orange"</span>&gt;
        <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#25351;&#23450;&#24378;&#21046;&#32487;&#25215;&#29238;&#31867;border&#23646;&#24615;&#25928;&#26524;&#12290; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
        &lt;<span style="color: #ECA964;">strong</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"border: inherit"</span>&gt;
<span style="font-weight: bold;">          world</span>
<span style="font-weight: bold;">        </span>&lt;/<span style="color: #ECA964;">strong</span>&gt;
      &lt;/<span style="color: #ECA964;">p</span>&gt;
    &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf398222" class="outline-3">
<h3 id="orgf398222">注释</h3>
<div class="outline-text-3" id="text-orgf398222">
<p>
CSS文件的注释语法是 <code>/* */</code>
</p>
</div>
</div>
</div>
<div id="outline-container-org54391ec" class="outline-2">
<h2 id="org54391ec">选择器</h2>
<div class="outline-text-2" id="text-org54391ec">
<p>
选择器也就是让CSS样式应用于特定标签的规则。
</p>
</div>
