org/CSS3简明总结.org
** ID选择器
   通过ID属性选择HTML对象
   #+begin_src html
     <html>
       <style type="text/css">
         .p {
             color: red;
         }
         div .d-p{
             color: green;
         }
       </style>
         <body>
           <p class="p">p1 ~</p>
           <div>
             <p class="d-p">p2 ~</p>
             <p class="d-p">p3 ~</p>
           </div>
         </body>
     </html>
   #+end_src
** 属性选择器
   通过属性值选择HTML对象
   #+begin_src html
     <html>
       <style type="text/css">
         [type="text"] {
             color: red;
         }
         input[type="password"] {
             color: green;
         }
       </style>
       <body>
         <input type="text" name="" value="" />
         <input type="password" name="" value="" />
       </body>
     </html>
   #+end_src
** 合并选择
   可以同时选择多个标签设置样式
   #+begin_src html
     <html>
       <style type="text/css">
         p , div{
             color: red;
         }
       </style>
       <body>
         <p>p~</p>
         <div>
           div ~
         </div>
       </body>
     </html>
   #+end_src
** 子类选择器
   可以根据深度选择子元素。
   #+begin_src html
     <html>
  
       <style type="text/css">
         /* 选择div的所有深度子标签strong */
         div strong{
             color: red;
         }
         /* 选择div的子标签strong */
         div > strong{
             color: green;
         }
       </style>
       <body>
         <div>
           <strong>div > strong ~</strong>
           <p><strong>div > p > strong ~</strong></p>
         </div>
       </body>
     </html>
   #+end_src
** 子类过滤器
   根据标签排列顺序的选择器。
   #+begin_src html
     <html>  
       <style type="text/css">
         /* 选择过滤到的第一个p标签 */
         p:first-child {
             color: red;
         }
         /* 选择过滤到的第2个p标签 */
         p:nth-child(2) {
             color: green;
         }
         p:nth-child(3) {
             color: yellow;
         }
         /* 选择过滤到的最后一个p标签 */
         p:last-child{
             color: blue;
         }
       </style>
       <body>
         <p>p1 ~</p>
         <p>p2 ~</p>
         <p>p3 ~</p>
         <p>p4 ~</p>
       </body>
     </html>
   #+end_src
** 星号选择器
   常常用于整个网页的初始化样式
   #+begin_src html
     <html>  
       <style type="text/css">
         /* 所有标签初始化都会有个红色下划线 */
         ,* {
             border-bottom-width: 2px;
             border-color: red;
             border-bottom-style: solid;
         }
       </style>
       <body>
         <p>p1 ~</p>
         <p>p2 ~</p>
         <p>p3 ~</p>
         <p>p4 ~</p>
       </body>
     </html>
   #+end_src
* 颜色
** 定义颜色的三种方式
   #+begin_src html
     <html>  
       <style type="text/css">
         .color-name{
             color: red;
         }
         .hexadecimal{
             color: #008000;
         }
         .rgb{
             color : rgb(0,0,255);
         }
    
       </style>
       <body>
         <span class="color-name">颜色名称</span>
         <span class="hexadecimal">十六进制</span>
         <span class="rgb">rgb</span>
       </body>
     </html>
   #+end_src
* 单位
** px
   px代表像素单位，其是根据显示器分辨率进行参照的测量单位。
   #+begin_src html
     <html>
       <body>
         <span style="font-size: 11px">10</span>
         <span style="font-size: 12px">20</span>
         <span style="font-size: 13px">30</span>
         <span style="font-size: 14px">40</span>
         <span style="font-size: 15px">50</span>
       </body>
     </html>
   #+end_src
