CSS3简明总结.html
<div id="outline-container-orgff4d5b3" class="outline-3">
<h3 id="orgff4d5b3">元素选择器</h3>
<div class="outline-text-3" id="text-orgff4d5b3">
<p>
通过标签名选择HTML对象
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
    /* &#36873;&#20013;&#25152;&#26377;p&#26631;&#31614; */
     p{
         color: red;
     }
     /* &#36873;&#20013;div&#26631;&#31614;&#20869;&#30340;p&#26631;&#31614; */
     div p{
         color: green;
     }
    &lt;/<span style="color: #ECA964;">style</span>&gt;
    &lt;<span style="color: #ECA964;">body</span>&gt;
      &lt;<span style="color: #ECA964;">p</span>&gt;p1 ~&lt;/<span style="color: #ECA964;">p</span>&gt;
      &lt;<span style="color: #ECA964;">div</span>&gt;
        &lt;<span style="color: #ECA964;">p</span>&gt;p2 ~&lt;/<span style="color: #ECA964;">p</span>&gt;
        &lt;<span style="color: #ECA964;">p</span>&gt;p3 ~&lt;/<span style="color: #ECA964;">p</span>&gt;
      &lt;/<span style="color: #ECA964;">div</span>&gt;
    &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org32fd13d" class="outline-3">
<h3 id="org32fd13d">ID选择器</h3>
<div class="outline-text-3" id="text-org32fd13d">
<p>
通过ID属性选择HTML对象
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
    .p {
        color: red;
    }
    div .d-p{
        color: green;
    }
  &lt;/<span style="color: #ECA964;">style</span>&gt;
    &lt;<span style="color: #ECA964;">body</span>&gt;
      &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">class</span>=<span style="color: #10CFC0;">"p"</span>&gt;p1 ~&lt;/<span style="color: #ECA964;">p</span>&gt;
      &lt;<span style="color: #ECA964;">div</span>&gt;
        &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">class</span>=<span style="color: #10CFC0;">"d-p"</span>&gt;p2 ~&lt;/<span style="color: #ECA964;">p</span>&gt;
        &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">class</span>=<span style="color: #10CFC0;">"d-p"</span>&gt;p3 ~&lt;/<span style="color: #ECA964;">p</span>&gt;
      &lt;/<span style="color: #ECA964;">div</span>&gt;
    &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org3b3cb4c" class="outline-3">
<h3 id="org3b3cb4c">属性选择器</h3>
<div class="outline-text-3" id="text-org3b3cb4c">
<p>
通过属性值选择HTML对象
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
    [type="text"] {
        color: red;
    }
    input[type="password"] {
        color: green;
    }
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">input</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text"</span> <span style="color: #31C6FF;">name</span>=<span style="color: #10CFC0;">""</span> <span style="color: #31C6FF;">value</span>=<span style="color: #10CFC0;">""</span> /&gt;
    &lt;<span style="color: #ECA964;">input</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"password"</span> <span style="color: #31C6FF;">name</span>=<span style="color: #10CFC0;">""</span> <span style="color: #31C6FF;">value</span>=<span style="color: #10CFC0;">""</span> /&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbaea56e" class="outline-3">
<h3 id="orgbaea56e">合并选择</h3>
<div class="outline-text-3" id="text-orgbaea56e">
<p>
可以同时选择多个标签设置样式
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
    p , div{
        color: red;
    }
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">p</span>&gt;p~&lt;/<span style="color: #ECA964;">p</span>&gt;
    &lt;<span style="color: #ECA964;">div</span>&gt;
      div ~
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc2ed099" class="outline-3">
<h3 id="orgc2ed099">子类选择器</h3>
<div class="outline-text-3" id="text-orgc2ed099">
<p>
可以根据深度选择子元素。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;

  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
    /* &#36873;&#25321;div&#30340;&#25152;&#26377;&#28145;&#24230;&#23376;&#26631;&#31614;strong */
    div strong{
        color: red;
    }
    /* &#36873;&#25321;div&#30340;&#23376;&#26631;&#31614;strong */
    div &gt; strong{
        color: green;
    }
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">div</span>&gt;
      &lt;<span style="color: #ECA964;">strong</span>&gt;<span style="font-weight: bold;">div &gt; strong ~</span>&lt;/<span style="color: #ECA964;">strong</span>&gt;
      &lt;<span style="color: #ECA964;">p</span>&gt;&lt;<span style="color: #ECA964;">strong</span>&gt;<span style="font-weight: bold;">div &gt; p &gt; strong ~</span>&lt;/<span style="color: #ECA964;">strong</span>&gt;&lt;/<span style="color: #ECA964;">p</span>&gt;
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org218a4e7" class="outline-3">
<h3 id="org218a4e7">子类过滤器</h3>
<div class="outline-text-3" id="text-org218a4e7">
<p>
根据标签排列顺序的选择器。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;  
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
    /* &#36873;&#25321;&#36807;&#28388;&#21040;&#30340;&#31532;&#19968;&#20010;p&#26631;&#31614; */
    p:first-child {
        color: red;
    }
    /* &#36873;&#25321;&#36807;&#28388;&#21040;&#30340;&#31532;2&#20010;p&#26631;&#31614; */
    p:nth-child(2) {
        color: green;
    }
    p:nth-child(3) {
        color: yellow;
    }
    /* &#36873;&#25321;&#36807;&#28388;&#21040;&#30340;&#26368;&#21518;&#19968;&#20010;p&#26631;&#31614; */
    p:last-child{
        color: blue;
    }
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">p</span>&gt;p1 ~&lt;/<span style="color: #ECA964;">p</span>&gt;
    &lt;<span style="color: #ECA964;">p</span>&gt;p2 ~&lt;/<span style="color: #ECA964;">p</span>&gt;
    &lt;<span style="color: #ECA964;">p</span>&gt;p3 ~&lt;/<span style="color: #ECA964;">p</span>&gt;
    &lt;<span style="color: #ECA964;">p</span>&gt;p4 ~&lt;/<span style="color: #ECA964;">p</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org70bde35" class="outline-3">
<h3 id="org70bde35">星号选择器</h3>
<div class="outline-text-3" id="text-org70bde35">
<p>
常常用于整个网页的初始化样式
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;  
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
    /* &#25152;&#26377;&#26631;&#31614;&#21021;&#22987;&#21270;&#37117;&#20250;&#26377;&#20010;&#32418;&#33394;&#19979;&#21010;&#32447; */
    * {
        border-bottom-width: 2px;
        border-color: red;
        border-bottom-style: solid;
    }
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">p</span>&gt;p1 ~&lt;/<span style="color: #ECA964;">p</span>&gt;
    &lt;<span style="color: #ECA964;">p</span>&gt;p2 ~&lt;/<span style="color: #ECA964;">p</span>&gt;
    &lt;<span style="color: #ECA964;">p</span>&gt;p3 ~&lt;/<span style="color: #ECA964;">p</span>&gt;
    &lt;<span style="color: #ECA964;">p</span>&gt;p4 ~&lt;/<span style="color: #ECA964;">p</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1232aca" class="outline-2">
<h2 id="org1232aca">颜色</h2>
<div class="outline-text-2" id="text-org1232aca">
</div>
<div id="outline-container-orgce42bc3" class="outline-3">
<h3 id="orgce42bc3">定义颜色的三种方式</h3>
<div class="outline-text-3" id="text-orgce42bc3">
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;  
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
    .color-name{
        color: red;
    }
    .hexadecimal{
        color: #008000;
    }
    .rgb{
        color : rgb(0,0,255);
    }

  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">class</span>=<span style="color: #10CFC0;">"color-name"</span>&gt;&#39068;&#33394;&#21517;&#31216;&lt;/<span style="color: #ECA964;">span</span>&gt;
    &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">class</span>=<span style="color: #10CFC0;">"hexadecimal"</span>&gt;&#21313;&#20845;&#36827;&#21046;&lt;/<span style="color: #ECA964;">span</span>&gt;
    &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">class</span>=<span style="color: #10CFC0;">"rgb"</span>&gt;rgb&lt;/<span style="color: #ECA964;">span</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org35576d3" class="outline-2">
<h2 id="org35576d3">单位</h2>
<div class="outline-text-2" id="text-org35576d3">
</div>
<div id="outline-container-org234150f" class="outline-3">
<h3 id="org234150f">px</h3>
<div class="outline-text-3" id="text-org234150f">
<p>
px代表像素单位，其是根据显示器分辨率进行参照的测量单位。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 11px"</span>&gt;10&lt;/<span style="color: #ECA964;">span</span>&gt;
    &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 12px"</span>&gt;20&lt;/<span style="color: #ECA964;">span</span>&gt;
    &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 13px"</span>&gt;30&lt;/<span style="color: #ECA964;">span</span>&gt;
    &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 14px"</span>&gt;40&lt;/<span style="color: #ECA964;">span</span>&gt;
    &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 15px"</span>&gt;50&lt;/<span style="color: #ECA964;">span</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
