org/CSS3简明总结.org
** %
   百分比单位，以浏览器默认字体大小为参照的测量单位。
   #+begin_src html
     <html>
       <body>
         <span style="font-size: 10%">10</span>
         <span style="font-size: 20%">20</span>
         <span style="font-size: 30%">30</span>
         <span style="font-size: 40%">40</span>
         <span style="font-size: 60%">60</span>
         <span style="font-size: 70%">70</span>
         <span style="font-size: 80%">80</span>
         <span style="font-size: 90%">90</span>
       </body>
     </html>
   #+end_src
** em
   相对单位，相对父标签的字体大小。
   #+begin_src html
     <html>
       <body>
         <p style="font-size: 10px;">
           <!-- 1倍父标签字体大小 -->
           <span style="font-size: 1em;">10px</span>
           <!-- 1.5倍大小 -->
           <span style="font-size: 1.5em;">15px</span>
           <!-- 2倍大小 -->
           <span style="font-size: 2em;">20px</span>
         </p>
       </body>
     </html>
   #+end_src
** rem
   相对网页初始字体大小。
   #+begin_src html
     <html>
       <style type="text/css">
         ,* {
             font-size: 10px;
         }
       </style>
    
       <body>
         <p style="font-size: 10px;">
           <!-- 1倍网页字体大小 -->
           <span style="font-size: 1rem;">10px</span>
           <!-- 1.5倍大小 -->
           <span style="font-size: 1.5rem;">15px</span>
           <!-- 2倍大小 -->
           <span style="font-size: 2rem;">20px</span>
         </p>
       </body>
     </html>
   #+end_src
** 小节
   ~em~ 和 ~rem~ 比 ~px~ 更加常用，因为其可以在用户改变网页默认大小或父标签大小改变时自适应改变。但是不够 ~px~ 灵活，
* 字体
  下面是一些字体相关的设置:
  #+begin_src html
    <html>
      <style type="text/css">
        ,* {
            font-size: 15px;
        }
        @font-face{
            font-family: SFCompactDisplay;
            src: url{'/usr/share/fonts/OTF/SFCompactDisplay-Bold.otf'}
        }
      </style>
    
      <body>
        <!-- 指定字体大小 -->
        <span style="font-size: 16px;"> 字体大小 </span>
        <!-- 指定字体风格为斜体 -->
        <p style="font-style: italic;"> 字体斜体 </p>
        <!-- 指定字体风格为粗体 -->
        <p style="font-style: bold;"> 字体粗体 </p>
        <!-- 指定字体为用户主机的字体 -->
        <p style="font-family: Fira Code;"> hello world </p>
        <!-- 指定在线字体 -->
        <p style="font-family: SFCompactDisplay;"> HTML/CSS </p>
        <!-- 多个字体设置简写成一条 -->
        <!-- font [斜体/加粗] 字体大小 字体类型 -->
        <p style="font: italic bold 16px Fira Code"> EvanMeek </p>
      </body>
    </html>
  #+end_src
* 文本
** 首行缩进
   ~text-indent~
   #+begin_src html
     <html>    
       <body>
         <p style="text-indent: 25px;">
           一行
           <br>
           二行
           <br>
           三行
           <br>
           N行
         </p>
       </body>
     </html>
   #+end_src
