CSS3简明总结.html
<div id="outline-container-org848784c" class="outline-3">
<h3 id="org848784c">%</h3>
<div class="outline-text-3" id="text-org848784c">
<p>
百分比单位，以浏览器默认字体大小为参照的测量单位。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 10%"</span>&gt;10&lt;/<span style="color: #ECA964;">span</span>&gt;
    &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 20%"</span>&gt;20&lt;/<span style="color: #ECA964;">span</span>&gt;
    &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 30%"</span>&gt;30&lt;/<span style="color: #ECA964;">span</span>&gt;
    &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 40%"</span>&gt;40&lt;/<span style="color: #ECA964;">span</span>&gt;
    &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 60%"</span>&gt;60&lt;/<span style="color: #ECA964;">span</span>&gt;
    &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 70%"</span>&gt;70&lt;/<span style="color: #ECA964;">span</span>&gt;
    &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 80%"</span>&gt;80&lt;/<span style="color: #ECA964;">span</span>&gt;
    &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 90%"</span>&gt;90&lt;/<span style="color: #ECA964;">span</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc2ffc37" class="outline-3">
<h3 id="orgc2ffc37">em</h3>
<div class="outline-text-3" id="text-orgc2ffc37">
<p>
相对单位，相对父标签的字体大小。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 10px;"</span>&gt;
      <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">1&#20493;&#29238;&#26631;&#31614;&#23383;&#20307;&#22823;&#23567; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
      &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 1em;"</span>&gt;10px&lt;/<span style="color: #ECA964;">span</span>&gt;
      <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">1.5&#20493;&#22823;&#23567; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
      &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 1.5em;"</span>&gt;15px&lt;/<span style="color: #ECA964;">span</span>&gt;
      <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">2&#20493;&#22823;&#23567; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
      &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 2em;"</span>&gt;20px&lt;/<span style="color: #ECA964;">span</span>&gt;
    &lt;/<span style="color: #ECA964;">p</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org5d587fd" class="outline-3">
<h3 id="org5d587fd">rem</h3>
<div class="outline-text-3" id="text-org5d587fd">
<p>
相对网页初始字体大小。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
    * {
        font-size: 10px;
    }
  &lt;/<span style="color: #ECA964;">style</span>&gt;

  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 10px;"</span>&gt;
      <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">1&#20493;&#32593;&#39029;&#23383;&#20307;&#22823;&#23567; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
      &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 1rem;"</span>&gt;10px&lt;/<span style="color: #ECA964;">span</span>&gt;
      <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">1.5&#20493;&#22823;&#23567; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
      &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 1.5rem;"</span>&gt;15px&lt;/<span style="color: #ECA964;">span</span>&gt;
      <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">2&#20493;&#22823;&#23567; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
      &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 2rem;"</span>&gt;20px&lt;/<span style="color: #ECA964;">span</span>&gt;
    &lt;/<span style="color: #ECA964;">p</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org7ebfb33" class="outline-3">
<h3 id="org7ebfb33">小节</h3>
<div class="outline-text-3" id="text-org7ebfb33">
<p>
<code>em</code> 和 <code>rem</code> 比 <code>px</code> 更加常用，因为其可以在用户改变网页默认大小或父标签大小改变时自适应改变。但是不够 <code>px</code> 灵活，
</p>
</div>
</div>
</div>
<div id="outline-container-org8786a85" class="outline-2">
<h2 id="org8786a85">字体</h2>
<div class="outline-text-2" id="text-org8786a85">
<p>
下面是一些字体相关的设置:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
    * {
        font-size: 15px;
    }
    @font-face{
        font-family: SFCompactDisplay;
        src: url{'/usr/share/fonts/OTF/SFCompactDisplay-Bold.otf'}
    }
  &lt;/<span style="color: #ECA964;">style</span>&gt;

  &lt;<span style="color: #ECA964;">body</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#25351;&#23450;&#23383;&#20307;&#22823;&#23567; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 16px;"</span>&gt; &#23383;&#20307;&#22823;&#23567; &lt;/<span style="color: #ECA964;">span</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#25351;&#23450;&#23383;&#20307;&#39118;&#26684;&#20026;&#26012;&#20307; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-style: italic;"</span>&gt; &#23383;&#20307;&#26012;&#20307; &lt;/<span style="color: #ECA964;">p</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#25351;&#23450;&#23383;&#20307;&#39118;&#26684;&#20026;&#31895;&#20307; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-style: bold;"</span>&gt; &#23383;&#20307;&#31895;&#20307; &lt;/<span style="color: #ECA964;">p</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#25351;&#23450;&#23383;&#20307;&#20026;&#29992;&#25143;&#20027;&#26426;&#30340;&#23383;&#20307; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-family: Fira Code;"</span>&gt; hello world &lt;/<span style="color: #ECA964;">p</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#25351;&#23450;&#22312;&#32447;&#23383;&#20307; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-family: SFCompactDisplay;"</span>&gt; HTML/CSS &lt;/<span style="color: #ECA964;">p</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#22810;&#20010;&#23383;&#20307;&#35774;&#32622;&#31616;&#20889;&#25104;&#19968;&#26465; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">font [&#26012;&#20307;/&#21152;&#31895;] &#23383;&#20307;&#22823;&#23567; &#23383;&#20307;&#31867;&#22411; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font: italic bold 16px Fira Code"</span>&gt; EvanMeek &lt;/<span style="color: #ECA964;">p</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf7fe6b7" class="outline-2">
<h2 id="orgf7fe6b7">文本</h2>
<div class="outline-text-2" id="text-orgf7fe6b7">
</div>
<div id="outline-container-orgdcf7f40" class="outline-3">
<h3 id="orgdcf7f40">首行缩进</h3>
<div class="outline-text-3" id="text-orgdcf7f40">
<p>
<code>text-indent</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;    
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"text-indent: 25px;"</span>&gt;
      &#19968;&#34892;
      &lt;<span style="color: #ECA964;">br</span>&gt;
      &#20108;&#34892;
      &lt;<span style="color: #ECA964;">br</span>&gt;
      &#19977;&#34892;
      &lt;<span style="color: #ECA964;">br</span>&gt;
      N&#34892;
    &lt;/<span style="color: #ECA964;">p</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
