org/CSS3简明总结.org
** 划线
   ~text-decoration~
   #+begin_src html
     <html>    
       <body>
         <!-- 上划线 -->
         <span style="text-decoration: overline;"> 上 </span>
         <!-- 中划线 -->
         <span style="text-decoration: line-through;"> 中 </span>
         <!-- 下划线 -->
         <span style="text-decoration: underline"> 下 </span>
       </body>
     </html>
   #+end_src
** 文本对齐
   ~text-align~
   #+begin_src html
     <html>    
       <body>
         <p style="text-align: left;"> 左 </p>
         <p style="text-align: center;"> 中 </p>
         <p style="text-align: right;"> 右 </p>
       </body>
     </html>
   #+end_src
** 行高
   ~line-height~
   #+begin_src html
     <html>    
       <body>
         <p style="line-height: 50px; border: 2px solid;">
           1行
           <br>
           2行
         </p>
         <p style="line-height: 100px; border: 2px solid;">
           1行
           <br>
           2行
         </p>
       </body>
     </html>
   #+end_src
** 间距
   ~letter-spacing~
   #+begin_src html
     <html>    
       <body>
         <em style="letter-spacing: 10px;">间距</em>
       </body>
     </html>
   #+end_src
** 换行
   ~white-space~
   #+begin_src html
     <html>    
       <body>
         <!-- normal | 默认值自动换行 -->
         <p style="background: #a3a7e4; width: 28px; white-space: normal;">换行测试</p>
         <!-- nowrap | 默认不换行 -->
         <p style="background: #a3a7e4; width: 28px; white-space: nowrap;">不换行测试</p>
       </body>
     </html>
   #+end_src
** 阴影
   ~text-shadow~
   #+begin_src html
     <html>    
       <body>
         <div style="text-shadow: 2px 2px red">
           Test
         </div>
       </body>
     </html>
   #+end_src
* 光标
  #+begin_src html
    <html>
      <style type="text/css">
        a:hover{
            cursor: pointer;
            /* 可选项
               default : 默认
               help    : 帮助
               wait    : 等待沙漏
               move    : 可移动
               text    : 选择
           ,*/
        }
      </style>
      <body>
        <a href="https://www.baidu.com">百度</a>
      </body>
    </html>
  #+end_src
* 盒子模型
** 元素形态
   元素即标签，标签分为两种形态：块形态和行形态。
   每个标签默认都有一种形态，可以通过CSS指定标签的形态。
   #+begin_src html
     <div style="background: green;">块元素</div>
     <span style="background: red;">行元素</span>
   #+end_src
   块元素可以作为 ~盒子~ ，也就是作为其他元素的容器。
** 修改元素形态
   通过 ~display~ 属性可以修改元素形态。并且还可以为其设置宽高。
   #+begin_src html
     <div style="display: inline; background: #d0efb5;">
       inline
     </div>
     <span style="display: block; background: #f3e595;">
       block
     </span>
     <div style="display: none;">
       none
     </div>
   #+end_src
