CSS3简明总结.html
<div id="outline-container-org96691d1" class="outline-3">
<h3 id="org96691d1">划线</h3>
<div class="outline-text-3" id="text-org96691d1">
<p>
<code>text-decoration</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;    
  &lt;<span style="color: #ECA964;">body</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#19978;&#21010;&#32447; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"text-decoration: overline;"</span>&gt; &#19978; &lt;/<span style="color: #ECA964;">span</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#20013;&#21010;&#32447; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"text-decoration: line-through;"</span>&gt; &#20013; &lt;/<span style="color: #ECA964;">span</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#19979;&#21010;&#32447; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"text-decoration: underline"</span>&gt; &#19979; &lt;/<span style="color: #ECA964;">span</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org4e1cb1a" class="outline-3">
<h3 id="org4e1cb1a">文本对齐</h3>
<div class="outline-text-3" id="text-org4e1cb1a">
<p>
<code>text-align</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;    
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"text-align: left;"</span>&gt; &#24038; &lt;/<span style="color: #ECA964;">p</span>&gt;
    &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"text-align: center;"</span>&gt; &#20013; &lt;/<span style="color: #ECA964;">p</span>&gt;
    &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"text-align: right;"</span>&gt; &#21491; &lt;/<span style="color: #ECA964;">p</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org78110ca" class="outline-3">
<h3 id="org78110ca">行高</h3>
<div class="outline-text-3" id="text-org78110ca">
<p>
<code>line-height</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;    
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"line-height: 50px; border: 2px solid;"</span>&gt;
      1&#34892;
      &lt;<span style="color: #ECA964;">br</span>&gt;
      2&#34892;
    &lt;/<span style="color: #ECA964;">p</span>&gt;
    &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"line-height: 100px; border: 2px solid;"</span>&gt;
      1&#34892;
      &lt;<span style="color: #ECA964;">br</span>&gt;
      2&#34892;
    &lt;/<span style="color: #ECA964;">p</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org5036fa5" class="outline-3">
<h3 id="org5036fa5">间距</h3>
<div class="outline-text-3" id="text-org5036fa5">
<p>
<code>letter-spacing</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;    
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">em</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"letter-spacing: 10px;"</span>&gt;<span style="text-decoration: underline;">&#38388;&#36317;</span>&lt;/<span style="color: #ECA964;">em</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orge2cf13d" class="outline-3">
<h3 id="orge2cf13d">换行</h3>
<div class="outline-text-3" id="text-orge2cf13d">
<p>
<code>white-space</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;    
  &lt;<span style="color: #ECA964;">body</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">normal | &#40664;&#35748;&#20540;&#33258;&#21160;&#25442;&#34892; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"background: #a3a7e4; width: 28px; white-space: normal;"</span>&gt;&#25442;&#34892;&#27979;&#35797;&lt;/<span style="color: #ECA964;">p</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">nowrap | &#40664;&#35748;&#19981;&#25442;&#34892; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"background: #a3a7e4; width: 28px; white-space: nowrap;"</span>&gt;&#19981;&#25442;&#34892;&#27979;&#35797;&lt;/<span style="color: #ECA964;">p</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org3dac411" class="outline-3">
<h3 id="org3dac411">阴影</h3>
<div class="outline-text-3" id="text-org3dac411">
<p>
<code>text-shadow</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;    
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"text-shadow: 2px 2px red"</span>&gt;
      Test
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org001be59" class="outline-2">
<h2 id="org001be59">光标</h2>
<div class="outline-text-2" id="text-org001be59">
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
    a:hover{
        cursor: pointer;
        /* &#21487;&#36873;&#39033;
           default : &#40664;&#35748;
           help    : &#24110;&#21161;
           wait    : &#31561;&#24453;&#27801;&#28431;
           move    : &#21487;&#31227;&#21160;
           text    : &#36873;&#25321;
       */
    }
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">a</span> <span style="color: #31C6FF;">href</span>=<span style="color: #10CFC0;">"https://www.baidu.com"</span>&gt;&#30334;&#24230;&lt;/<span style="color: #ECA964;">a</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org55b2967" class="outline-2">
<h2 id="org55b2967">盒子模型</h2>
<div class="outline-text-2" id="text-org55b2967">
</div>
<div id="outline-container-orgb2ffef3" class="outline-3">
<h3 id="orgb2ffef3">元素形态</h3>
<div class="outline-text-3" id="text-orgb2ffef3">
<p>
元素即标签，标签分为两种形态：块形态和行形态。
每个标签默认都有一种形态，可以通过CSS指定标签的形态。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"background: green;"</span>&gt;&#22359;&#20803;&#32032;&lt;/<span style="color: #ECA964;">div</span>&gt;
&lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"background: red;"</span>&gt;&#34892;&#20803;&#32032;&lt;/<span style="color: #ECA964;">span</span>&gt;
</pre>
</div>
<p>
块元素可以作为 <code>盒子</code> ，也就是作为其他元素的容器。
</p>
</div>
</div>
<div id="outline-container-org69f97c1" class="outline-3">
<h3 id="org69f97c1">修改元素形态</h3>
<div class="outline-text-3" id="text-org69f97c1">
<p>
通过 <code>display</code> 属性可以修改元素形态。并且还可以为其设置宽高。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"display: inline; background: #d0efb5;"</span>&gt;
  inline
&lt;/<span style="color: #ECA964;">div</span>&gt;
&lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"display: block; background: #f3e595;"</span>&gt;
  block
&lt;/<span style="color: #ECA964;">span</span>&gt;
&lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"display: none;"</span>&gt;
  none
&lt;/<span style="color: #ECA964;">div</span>&gt;
</pre>
</div>
</div>
</div>
