org/CSS3简明总结.org
** 盒子大小
   可以为盒子指定宽高。
   #+begin_src html
     <html>
       <body>
         <div style="width: 100px; height: 100px; background: blue;"></div>
       </body>
     </html>
   #+end_src
   对于响应式网站，可以设置最大最小宽高限制。
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <div style="min-width: 200; min-height: 200px;">
           宽高不能大于200px;
         </div>2
         <div style="min-width: 200; max-height: 200px;">
           宽高不能大于200px;
         </div>
       </body>
     </html>
   #+end_src
   盒子的宽高默认值是 ~auto~ 。
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <div style="width: 100px; height: 100px; background: green;">
         <!-- width: auto 于父容器等宽 -->
         <!-- height: auto 于容器中的内容等高 -->
           <div style="width: auto; height: auto; background: red;">
             1. <br>
             2.
           </div>
           <div style="width: auto; height: auto; background: blue;">
             3. <br>
             4.
           </div>
         </div>
       </body>
     </html>
   #+end_src
** 盒子溢出内容处理方式
   当内容面积大于容器面积，那么会有两种处理方式。
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <!-- 不做处理 -->
         <p style="width: 100px; background: green; white-space: nowrap;">佛系放弃治疗~~~~~</p>
         <!-- 溢出的隐藏 -->
         <p style="width: 50px; background: red; white-space: nowrap; overflow: hidden;">不佛系，坚持治疗~~~~~</p>
         <!-- 自动处理 -->
         <!-- overflow可选为overflow-y: 仅显示上下滚动条。overflow-x: 仅显示左右滚动条。 -->
         <p style="width: 50px; background: blue; white-space: nowrap; overflow: auto;">佛系，全自动模式~~~~~</p>
         <!-- 默认就显示滚动条 | scroll -->
         <p style="width: 50px; background: yellow; white-space: nowrap; overflow: scroll;">你爱或者不爱，爱就在这里，不增不减~</p>
       </body>
     </html>
   #+end_src
** 占位
   ~visibility~
   占位的作用是可以使得内容不可见，但是位置仍然存在。
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <div style="visibility: hidden; width: 20px; height: 20px;">
           占位
         </div>
         <div style="width: 20px; height: 20px; background: green;"></div>
       </body>
     </html>
   #+end_src
** box-sizing
   作用是固定大小，盒子大小不会被边框，边距所影响。
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <div style="width: 100px; height: 100px; box-sizing: border-box; background: green; padding: 20px;">
         </div>
       </body>
     </html>
   #+end_src
** content-box
   作用是动态更变大小，受到边框、边距的影响。
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         有pdding
         <div style="width: 100px; height: 100px; box-sizing: content-box; background: blue; padding: 20px;"></div>
         <br>
         没有padding
         <div style="width: 100px; height: 100px; box-sizing: content-box; background: blue;"></div>
       </body>
     </html>
   #+end_src
* 边框
** 简单的边框
   ~border~
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <div style="width: 100px; height: 100px; border: 10px dashed green;">
           <span style="text-align: center;">虚线边框</span>
         </div>
       </body>
     </html>
   #+end_src
