CSS3简明总结.html
<div id="outline-container-org8264ed3" class="outline-3">
<h3 id="org8264ed3">盒子大小</h3>
<div class="outline-text-3" id="text-org8264ed3">
<p>
可以为盒子指定宽高。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 100px; height: 100px; background: blue;"</span>&gt;&lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
<p>
对于响应式网站，可以设置最大最小宽高限制。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"min-width: 200; min-height: 200px;"</span>&gt;
      &#23485;&#39640;&#19981;&#33021;&#22823;&#20110;200px;
    &lt;/<span style="color: #ECA964;">div</span>&gt;2
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"min-width: 200; max-height: 200px;"</span>&gt;
      &#23485;&#39640;&#19981;&#33021;&#22823;&#20110;200px;
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
<p>
盒子的宽高默认值是 <code>auto</code> 。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 100px; height: 100px; background: green;"</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">width: auto &#20110;&#29238;&#23481;&#22120;&#31561;&#23485; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">height: auto &#20110;&#23481;&#22120;&#20013;&#30340;&#20869;&#23481;&#31561;&#39640; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
      &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: auto; height: auto; background: red;"</span>&gt;
        1. &lt;<span style="color: #ECA964;">br</span>&gt;
        2.
      &lt;/<span style="color: #ECA964;">div</span>&gt;
      &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: auto; height: auto; background: blue;"</span>&gt;
        3. &lt;<span style="color: #ECA964;">br</span>&gt;
        4.
      &lt;/<span style="color: #ECA964;">div</span>&gt;
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org6d5744f" class="outline-3">
<h3 id="org6d5744f">盒子溢出内容处理方式</h3>
<div class="outline-text-3" id="text-org6d5744f">
<p>
当内容面积大于容器面积，那么会有两种处理方式。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#19981;&#20570;&#22788;&#29702; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 100px; background: green; white-space: nowrap;"</span>&gt;&#20315;&#31995;&#25918;&#24323;&#27835;&#30103;~~~~~&lt;/<span style="color: #ECA964;">p</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#28322;&#20986;&#30340;&#38544;&#34255; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 50px; background: red; white-space: nowrap; overflow: hidden;"</span>&gt;&#19981;&#20315;&#31995;&#65292;&#22362;&#25345;&#27835;&#30103;~~~~~&lt;/<span style="color: #ECA964;">p</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#33258;&#21160;&#22788;&#29702; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">overflow&#21487;&#36873;&#20026;overflow-y: &#20165;&#26174;&#31034;&#19978;&#19979;&#28378;&#21160;&#26465;&#12290;overflow-x: &#20165;&#26174;&#31034;&#24038;&#21491;&#28378;&#21160;&#26465;&#12290; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 50px; background: blue; white-space: nowrap; overflow: auto;"</span>&gt;&#20315;&#31995;&#65292;&#20840;&#33258;&#21160;&#27169;&#24335;~~~~~&lt;/<span style="color: #ECA964;">p</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#40664;&#35748;&#23601;&#26174;&#31034;&#28378;&#21160;&#26465; | scroll </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">p</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 50px; background: yellow; white-space: nowrap; overflow: scroll;"</span>&gt;&#20320;&#29233;&#25110;&#32773;&#19981;&#29233;&#65292;&#29233;&#23601;&#22312;&#36825;&#37324;&#65292;&#19981;&#22686;&#19981;&#20943;~&lt;/<span style="color: #ECA964;">p</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org7bdd714" class="outline-3">
<h3 id="org7bdd714">占位</h3>
<div class="outline-text-3" id="text-org7bdd714">
<p>
<code>visibility</code>
占位的作用是可以使得内容不可见，但是位置仍然存在。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"visibility: hidden; width: 20px; height: 20px;"</span>&gt;
      &#21344;&#20301;
    &lt;/<span style="color: #ECA964;">div</span>&gt;
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 20px; height: 20px; background: green;"</span>&gt;&lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org8f4a95f" class="outline-3">
<h3 id="org8f4a95f">box-sizing</h3>
<div class="outline-text-3" id="text-org8f4a95f">
<p>
作用是固定大小，盒子大小不会被边框，边距所影响。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 100px; height: 100px; box-sizing: border-box; background: green; padding: 20px;"</span>&gt;
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf8b52f3" class="outline-3">
<h3 id="orgf8b52f3">content-box</h3>
<div class="outline-text-3" id="text-orgf8b52f3">
<p>
作用是动态更变大小，受到边框、边距的影响。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &#26377;pdding
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 100px; height: 100px; box-sizing: content-box; background: blue; padding: 20px;"</span>&gt;&lt;/<span style="color: #ECA964;">div</span>&gt;
    &lt;<span style="color: #ECA964;">br</span>&gt;
    &#27809;&#26377;padding
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 100px; height: 100px; box-sizing: content-box; background: blue;"</span>&gt;&lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2e6b0bb" class="outline-2">
<h2 id="org2e6b0bb">边框</h2>
<div class="outline-text-2" id="text-org2e6b0bb">
</div>
<div id="outline-container-org2305b8e" class="outline-3">
<h3 id="org2305b8e">简单的边框</h3>
<div class="outline-text-3" id="text-org2305b8e">
<p>
<code>border</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 100px; height: 100px; border: 10px dashed green;"</span>&gt;
      &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"text-align: center;"</span>&gt;&#34394;&#32447;&#36793;&#26694;&lt;/<span style="color: #ECA964;">span</span>&gt;
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
