org/CSS3简明总结.org
** 圆角
   ~border-radius~
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <!-- border-radius: 5px; 圆角的四个角的角度。 -->
         <!-- border-radius: 1px 2px 3px 4px; (左上角 / 右上角 / 右下角 / 左下角) 顺时针-->
         <div style="width: 100px; height: 100px; background: green; border-radius: 5px;">
         </div>
       </body>
     </html>
   #+end_src
** 轮廓
   ~outline~
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <!-- outline语法跟border相同，但是其是包括在border之外的。 -->
         <div style="width: 100px; height: 100px;
                     border: 5px solid green;
                     outline: 5px dashed red;">
         </div>
       </body>
     </html>
   #+end_src
** 阴影
   ~box-shadow~
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <!-- box-shadow盒子阴影-参数 -->
         <!-- 1. 水平阴影，正数靠右，负数靠左 -->
         <!-- 2. 垂直阴影，正数靠上，负数靠下 -->
         <!-- 3. 阴影模糊度 -->
         <!-- 4. 颜色 -->
         <div style="width: 100px; height: 100px;
                     border: 1px solid black;
                     box-shadow: 5px 5px 5px gray;">
         </div>
       </body>
     </html>
   #+end_src
* 边距
  CSS不仅允许标签具有边框，还允许具有边距，边距和边框不同的是，边距是指元素与元素之间的距离。
** 外边距
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <!-- 这里设置的外边距等于div标签与body标签的边距 -->
         <!-- margin-参数-->
         <!-- margin: 上 右 下 左 -->
         <!-- 可选属性: -->
         <!-- margin-top/right/bottom/left，可以单独设置某一边的外边距 -->
         <div style="width: 100px; height: 100px; background: green; margin: 20px;">
         </div>
       </body>
     </html>
   #+end_src
** 内边距
   内边距是内容离边框的距离。
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <div style="width: 100px; height: 100px;
                     border: 1px solid green;
                     padding: 20px;">
           <span style="border: 1px dashed red">内边距</span>
         </div>
       </body>
     </html>
   #+end_src
* 列表
** 符号样式
   可以设定列表的符号样式
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <ul style="list-style-type: decimal">
           <li>first</li>
           <li>second</li>
           <li>third</li>
         </ul>
         <!--
         更多符号:
         none: 取消符号
         disc: 实心圆
         circle: 空心圆
         square: 方块
         decimal: 阿拉伯数字
         lower-alpha: 小写字母
         upper-roman: 大写字母
         -->
       </body>
     </html>
   #+end_src
