CSS3简明总结.html
<div id="outline-container-org6abc990" class="outline-3">
<h3 id="org6abc990">圆角</h3>
<div class="outline-text-3" id="text-org6abc990">
<p>
<code>border-radius</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">border-radius: 5px; &#22278;&#35282;&#30340;&#22235;&#20010;&#35282;&#30340;&#35282;&#24230;&#12290; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">border-radius: 1px 2px 3px 4px; (&#24038;&#19978;&#35282; / &#21491;&#19978;&#35282; / &#21491;&#19979;&#35282; / &#24038;&#19979;&#35282;) &#39034;&#26102;&#38024;</span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 100px; height: 100px; background: green; border-radius: 5px;"</span>&gt;
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org2394696" class="outline-3">
<h3 id="org2394696">轮廓</h3>
<div class="outline-text-3" id="text-org2394696">
<p>
<code>outline</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">outline&#35821;&#27861;&#36319;border&#30456;&#21516;&#65292;&#20294;&#26159;&#20854;&#26159;&#21253;&#25324;&#22312;border&#20043;&#22806;&#30340;&#12290; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 100px; height: 100px;</span>
<span style="color: #10CFC0;">                border: 5px solid green;</span>
<span style="color: #10CFC0;">                outline: 5px dashed red;"</span>&gt;
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org00aabee" class="outline-3">
<h3 id="org00aabee">阴影</h3>
<div class="outline-text-3" id="text-org00aabee">
<p>
<code>box-shadow</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">box-shadow&#30418;&#23376;&#38452;&#24433;-&#21442;&#25968; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">1. &#27700;&#24179;&#38452;&#24433;&#65292;&#27491;&#25968;&#38752;&#21491;&#65292;&#36127;&#25968;&#38752;&#24038; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">2. &#22402;&#30452;&#38452;&#24433;&#65292;&#27491;&#25968;&#38752;&#19978;&#65292;&#36127;&#25968;&#38752;&#19979; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">3. &#38452;&#24433;&#27169;&#31946;&#24230; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">4. &#39068;&#33394; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 100px; height: 100px;</span>
<span style="color: #10CFC0;">                border: 1px solid black;</span>
<span style="color: #10CFC0;">                box-shadow: 5px 5px 5px gray;"</span>&gt;
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org79c4e63" class="outline-2">
<h2 id="org79c4e63">边距</h2>
<div class="outline-text-2" id="text-org79c4e63">
<p>
CSS不仅允许标签具有边框，还允许具有边距，边距和边框不同的是，边距是指元素与元素之间的距离。
</p>
</div>
<div id="outline-container-org3c6df6f" class="outline-3">
<h3 id="org3c6df6f">外边距</h3>
<div class="outline-text-3" id="text-org3c6df6f">
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#36825;&#37324;&#35774;&#32622;&#30340;&#22806;&#36793;&#36317;&#31561;&#20110;div&#26631;&#31614;&#19982;body&#26631;&#31614;&#30340;&#36793;&#36317; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">margin-&#21442;&#25968;</span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">margin: &#19978; &#21491; &#19979; &#24038; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#21487;&#36873;&#23646;&#24615;: </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">margin-top/right/bottom/left&#65292;&#21487;&#20197;&#21333;&#29420;&#35774;&#32622;&#26576;&#19968;&#36793;&#30340;&#22806;&#36793;&#36317; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 100px; height: 100px; background: green; margin: 20px;"</span>&gt;
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf2d26e1" class="outline-3">
<h3 id="orgf2d26e1">内边距</h3>
<div class="outline-text-3" id="text-orgf2d26e1">
<p>
内边距是内容离边框的距离。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 100px; height: 100px;</span>
<span style="color: #10CFC0;">                border: 1px solid green;</span>
<span style="color: #10CFC0;">                padding: 20px;"</span>&gt;
      &lt;<span style="color: #ECA964;">span</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"border: 1px dashed red"</span>&gt;&#20869;&#36793;&#36317;&lt;/<span style="color: #ECA964;">span</span>&gt;
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7c14f1b" class="outline-2">
<h2 id="org7c14f1b">列表</h2>
<div class="outline-text-2" id="text-org7c14f1b">
</div>
<div id="outline-container-orga498f9d" class="outline-3">
<h3 id="orga498f9d">符号样式</h3>
<div class="outline-text-3" id="text-orga498f9d">
<p>
可以设定列表的符号样式
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">ul</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"list-style-type: decimal"</span>&gt;
      &lt;<span style="color: #ECA964;">li</span>&gt;first&lt;/<span style="color: #ECA964;">li</span>&gt;
      &lt;<span style="color: #ECA964;">li</span>&gt;second&lt;/<span style="color: #ECA964;">li</span>&gt;
      &lt;<span style="color: #ECA964;">li</span>&gt;third&lt;/<span style="color: #ECA964;">li</span>&gt;
    &lt;/<span style="color: #ECA964;">ul</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!--</span>
<span style="color: #6B7887; text-decoration: underline;">    &#26356;&#22810;&#31526;&#21495;:</span>
<span style="color: #6B7887; text-decoration: underline;">    none: &#21462;&#28040;&#31526;&#21495;</span>
<span style="color: #6B7887; text-decoration: underline;">    disc: &#23454;&#24515;&#22278;</span>
<span style="color: #6B7887; text-decoration: underline;">    circle: &#31354;&#24515;&#22278;</span>
<span style="color: #6B7887; text-decoration: underline;">    square: &#26041;&#22359;</span>
<span style="color: #6B7887; text-decoration: underline;">    decimal: &#38463;&#25289;&#20271;&#25968;&#23383;</span>
<span style="color: #6B7887; text-decoration: underline;">    lower-alpha: &#23567;&#20889;&#23383;&#27597;</span>
<span style="color: #6B7887; text-decoration: underline;">    upper-roman: &#22823;&#20889;&#23383;&#27597;</span>
<span style="color: #6B7887; text-decoration: underline;">    </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
