org/CSS3简明总结.org
** 符号位置
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <!-- outside是默认值，作用是将符号显示在li标签的边框之外 -->
         <ul style="list-style-position: outside;">
           <li style="border: 1px solid green;">first</li>
         </ul>
         <!-- inside是显示在li标签边框之内。 -->
         <ul style="list-style-position: inside;">
           <li style="border: 1px solid red;">second</li>
         </ul>
       </body>
     </html>
   #+end_src
* 表格
** 表格间距
   表格之间的间距可以使用 ~border-spacing~ 设置。
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <table border="1" style="width: 200px; height: 100px;">
           <tr>
             <th colspan="2" style="font-size: 16px;">使用默认边距的表格</th>
           </tr>
           <tr style="text-align: center;">
             <td>A</td>
             <td>B</td>
           </tr>
         </table>
         <table border="1" style="width: 200px; height: 100px; border-spacing: 5px;
                                  margin-top: 20px;">
           <tr>
             <th colspan="2" style="font-size: 16px;">有边距的表格</th>
           <tr style="text-align: center;">
             <td>A</td>
             <td>B</td>
           </tr>
           </tr>
         </table>
       </body>
     </html>
   #+end_src
** 表格间距合并
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <table border="1" style="width: 200px; height: 100px;">
           <tr>
             <th colspan="2" style="font-size: 16px;">默认边距的表格</th>
           </tr>
           <tr style="text-align: center;">
             <td>A</td>
             <td>B</td>
           </tr>
         </table>
         <table border="1" style="width: 200px; height: 100px; border-collapse: collapse;
                                  margin-top: 20px;">
           <tr>
             <th colspan="2" style="font-size: 16px;">边距合并后的表格</th>
           <tr style="text-align: center;">
             <td>A</td>
             <td>B</td>
           </tr>
           </tr>
         </table>
       </body>
     </html>
   #+end_src
** 垂直高度
   ~vertical-align~
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <table border="1" style="width: 100px; height: 100px;
                                  border-collapse: collapse;
                                  text-align: center;
                                  vertical-align: middle;
                                  color: green;">
           <tr>
             <td>你</td>
             <td>好</td>
           </tr>
           <tr>
             <td>世</td>
             <td>界</td>
           </tr>
         </table>
       </body>
     </html>
   #+end_src
