CSS3简明总结.html
<div id="outline-container-orga869abe" class="outline-3">
<h3 id="orga869abe">符号位置</h3>
<div class="outline-text-3" id="text-orga869abe">
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">outside&#26159;&#40664;&#35748;&#20540;&#65292;&#20316;&#29992;&#26159;&#23558;&#31526;&#21495;&#26174;&#31034;&#22312;li&#26631;&#31614;&#30340;&#36793;&#26694;&#20043;&#22806; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">ul</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"list-style-position: outside;"</span>&gt;
      &lt;<span style="color: #ECA964;">li</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"border: 1px solid green;"</span>&gt;first&lt;/<span style="color: #ECA964;">li</span>&gt;
    &lt;/<span style="color: #ECA964;">ul</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">inside&#26159;&#26174;&#31034;&#22312;li&#26631;&#31614;&#36793;&#26694;&#20043;&#20869;&#12290; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">ul</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"list-style-position: inside;"</span>&gt;
      &lt;<span style="color: #ECA964;">li</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"border: 1px solid red;"</span>&gt;second&lt;/<span style="color: #ECA964;">li</span>&gt;
    &lt;/<span style="color: #ECA964;">ul</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org95c2d4d" class="outline-2">
<h2 id="org95c2d4d">表格</h2>
<div class="outline-text-2" id="text-org95c2d4d">
</div>
<div id="outline-container-orgdeeee3c" class="outline-3">
<h3 id="orgdeeee3c">表格间距</h3>
<div class="outline-text-3" id="text-orgdeeee3c">
<p>
表格之间的间距可以使用 <code>border-spacing</code> 设置。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">table</span> <span style="color: #31C6FF;">border</span>=<span style="color: #10CFC0;">"1"</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 200px; height: 100px;"</span>&gt;
      &lt;<span style="color: #ECA964;">tr</span>&gt;
        &lt;<span style="color: #ECA964;">th</span> <span style="color: #31C6FF;">colspan</span>=<span style="color: #10CFC0;">"2"</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 16px;"</span>&gt;&#20351;&#29992;&#40664;&#35748;&#36793;&#36317;&#30340;&#34920;&#26684;&lt;/<span style="color: #ECA964;">th</span>&gt;
      &lt;/<span style="color: #ECA964;">tr</span>&gt;
      &lt;<span style="color: #ECA964;">tr</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"text-align: center;"</span>&gt;
        &lt;<span style="color: #ECA964;">td</span>&gt;A&lt;/<span style="color: #ECA964;">td</span>&gt;
        &lt;<span style="color: #ECA964;">td</span>&gt;B&lt;/<span style="color: #ECA964;">td</span>&gt;
      &lt;/<span style="color: #ECA964;">tr</span>&gt;
    &lt;/<span style="color: #ECA964;">table</span>&gt;
    &lt;<span style="color: #ECA964;">table</span> <span style="color: #31C6FF;">border</span>=<span style="color: #10CFC0;">"1"</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 200px; height: 100px; border-spacing: 5px;</span>
<span style="color: #10CFC0;">                             margin-top: 20px;"</span>&gt;
      &lt;<span style="color: #ECA964;">tr</span>&gt;
        &lt;<span style="color: #ECA964;">th</span> <span style="color: #31C6FF;">colspan</span>=<span style="color: #10CFC0;">"2"</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 16px;"</span>&gt;&#26377;&#36793;&#36317;&#30340;&#34920;&#26684;&lt;/<span style="color: #ECA964;">th</span>&gt;
      &lt;<span style="color: #ECA964;">tr</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"text-align: center;"</span>&gt;
        &lt;<span style="color: #ECA964;">td</span>&gt;A&lt;/<span style="color: #ECA964;">td</span>&gt;
        &lt;<span style="color: #ECA964;">td</span>&gt;B&lt;/<span style="color: #ECA964;">td</span>&gt;
      &lt;/<span style="color: #ECA964;">tr</span>&gt;
      &lt;/<span style="color: #ECA964;">tr</span>&gt;
    &lt;/<span style="color: #ECA964;">table</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf2c4abb" class="outline-3">
<h3 id="orgf2c4abb">表格间距合并</h3>
<div class="outline-text-3" id="text-orgf2c4abb">
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">table</span> <span style="color: #31C6FF;">border</span>=<span style="color: #10CFC0;">"1"</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 200px; height: 100px;"</span>&gt;
      &lt;<span style="color: #ECA964;">tr</span>&gt;
        &lt;<span style="color: #ECA964;">th</span> <span style="color: #31C6FF;">colspan</span>=<span style="color: #10CFC0;">"2"</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 16px;"</span>&gt;&#40664;&#35748;&#36793;&#36317;&#30340;&#34920;&#26684;&lt;/<span style="color: #ECA964;">th</span>&gt;
      &lt;/<span style="color: #ECA964;">tr</span>&gt;
      &lt;<span style="color: #ECA964;">tr</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"text-align: center;"</span>&gt;
        &lt;<span style="color: #ECA964;">td</span>&gt;A&lt;/<span style="color: #ECA964;">td</span>&gt;
        &lt;<span style="color: #ECA964;">td</span>&gt;B&lt;/<span style="color: #ECA964;">td</span>&gt;
      &lt;/<span style="color: #ECA964;">tr</span>&gt;
    &lt;/<span style="color: #ECA964;">table</span>&gt;
    &lt;<span style="color: #ECA964;">table</span> <span style="color: #31C6FF;">border</span>=<span style="color: #10CFC0;">"1"</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 200px; height: 100px; border-collapse: collapse;</span>
<span style="color: #10CFC0;">                             margin-top: 20px;"</span>&gt;
      &lt;<span style="color: #ECA964;">tr</span>&gt;
        &lt;<span style="color: #ECA964;">th</span> <span style="color: #31C6FF;">colspan</span>=<span style="color: #10CFC0;">"2"</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"font-size: 16px;"</span>&gt;&#36793;&#36317;&#21512;&#24182;&#21518;&#30340;&#34920;&#26684;&lt;/<span style="color: #ECA964;">th</span>&gt;
      &lt;<span style="color: #ECA964;">tr</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"text-align: center;"</span>&gt;
        &lt;<span style="color: #ECA964;">td</span>&gt;A&lt;/<span style="color: #ECA964;">td</span>&gt;
        &lt;<span style="color: #ECA964;">td</span>&gt;B&lt;/<span style="color: #ECA964;">td</span>&gt;
      &lt;/<span style="color: #ECA964;">tr</span>&gt;
      &lt;/<span style="color: #ECA964;">tr</span>&gt;
    &lt;/<span style="color: #ECA964;">table</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgec281a3" class="outline-3">
<h3 id="orgec281a3">垂直高度</h3>
<div class="outline-text-3" id="text-orgec281a3">
<p>
<code>vertical-align</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">table</span> <span style="color: #31C6FF;">border</span>=<span style="color: #10CFC0;">"1"</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 100px; height: 100px;</span>
<span style="color: #10CFC0;">                             border-collapse: collapse;</span>
<span style="color: #10CFC0;">                             text-align: center;</span>
<span style="color: #10CFC0;">                             vertical-align: middle;</span>
<span style="color: #10CFC0;">                             color: green;"</span>&gt;
      &lt;<span style="color: #ECA964;">tr</span>&gt;
        &lt;<span style="color: #ECA964;">td</span>&gt;&#20320;&lt;/<span style="color: #ECA964;">td</span>&gt;
        &lt;<span style="color: #ECA964;">td</span>&gt;&#22909;&lt;/<span style="color: #ECA964;">td</span>&gt;
      &lt;/<span style="color: #ECA964;">tr</span>&gt;
      &lt;<span style="color: #ECA964;">tr</span>&gt;
        &lt;<span style="color: #ECA964;">td</span>&gt;&#19990;&lt;/<span style="color: #ECA964;">td</span>&gt;
        &lt;<span style="color: #ECA964;">td</span>&gt;&#30028;&lt;/<span style="color: #ECA964;">td</span>&gt;
      &lt;/<span style="color: #ECA964;">tr</span>&gt;
    &lt;/<span style="color: #ECA964;">table</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
