org/CSS3简明总结.org
** 比例分布
   ~table-layout~
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <p>动态分配大小</p>
         <table border="1" style="width: 200px; border-collapse: collapse; table-layout: auto;">
           <tr>
             <td>hello</td>
             <td>~</td>
           </tr>
         </table>
         <p>等比例</p>
         <table border="1" style="width: 200px; border-collapse: collapse; table-layout: fixed;">
           <tr>
             <td>world</td>
             <td>~</td>
           </tr>
         </table>
       </body>
     </html>
   #+end_src
* 背景
** 背景颜色
   ~background-color~
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <!-- 添加背景颜色 -->
         <div style="width: 640px; height: 50px;
                     background-color: green;">
         </div>
       </body>
     </html>
   #+end_src
** 背景图片
   ~background-image~
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <!-- 添加背景图片 -->
         <div style="width: 640px; height: 452px;
                     background-image: url(https://www.jmjc.tech/public/home/img/fly.jpg);">
         </div>
       </body>
     </html>
   #+end_src
** 重复背景图片
   ~background-repeat~
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <!-- 重复背景图片 -->
         <!-- background-repeat: repeat-x 横向重复 -->
         <!-- background-repeat: repeat-y 纵向重复 -->
         <!-- background-repeat: repeat 重复直到填满 -->
         <!-- background-repeat: no-repeat 取消重复 -->
         <div style="width: 1000px; height: 1000px;
                     background-repeat: repeat;
                     background-image: url(https://www.jmjc.tech/public/home/img/fly.jpg);">
         </div>
       </body>
     </html>
   #+end_src
** 图片尺寸
   ~background-size~
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <!-- 图片尺寸 -->
         <div style="width: 640px; height: 452px;
                     background-image: url(https://www.jmjc.tech/public/home/img/fly.jpg);
                     background-repeat: no-repeat;
                     background-size: 320px 226px;
                     border: 10px dashed red;">
         </div>
       </body>
     </html>
   #+end_src
** 图片位置
   ~background-position~
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <!-- 图片位置 -->
         <div style="width: 640px; height: 452px;
                     background-color: green;
                     background-image: url(https://www.jmjc.tech/public/home/img/fly.jpg);
                     background-repeat: no-repeat;
                     background-size: 320px 226px;
                     border: 10px dashed red;
                     background-position: 50% 50%">
         </div>
       </body>
     </html>
   #+end_src
** 固定背景位置
   固定背景后滚动条滚动背景图片不会随之移动。
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <!-- 固定背景位置 -->
         <div style="width: 640px; height: 452px;
                     background-color: green;
                     background-image: url(https://www.jmjc.tech/public/home/img/fly.jpg);
                     background-repeat: repeat;
                     background-size: 320px 226px;
                     border: 10px dashed red;
                     background-attachment: fixed;">
         </div>
       </body>
     </html>
   #+end_src
