CSS3简明总结.html
<div id="outline-container-org1c7c332" class="outline-3">
<h3 id="org1c7c332">比例分布</h3>
<div class="outline-text-3" id="text-org1c7c332">
<p>
<code>table-layout</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    &lt;<span style="color: #ECA964;">p</span>&gt;&#21160;&#24577;&#20998;&#37197;&#22823;&#23567;&lt;/<span style="color: #ECA964;">p</span>&gt;
    &lt;<span style="color: #ECA964;">table</span> <span style="color: #31C6FF;">border</span>=<span style="color: #10CFC0;">"1"</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 200px; border-collapse: collapse; table-layout: auto;"</span>&gt;
      &lt;<span style="color: #ECA964;">tr</span>&gt;
        &lt;<span style="color: #ECA964;">td</span>&gt;hello&lt;/<span style="color: #ECA964;">td</span>&gt;
        &lt;<span style="color: #ECA964;">td</span>&gt;~&lt;/<span style="color: #ECA964;">td</span>&gt;
      &lt;/<span style="color: #ECA964;">tr</span>&gt;
    &lt;/<span style="color: #ECA964;">table</span>&gt;
    &lt;<span style="color: #ECA964;">p</span>&gt;&#31561;&#27604;&#20363;&lt;/<span style="color: #ECA964;">p</span>&gt;
    &lt;<span style="color: #ECA964;">table</span> <span style="color: #31C6FF;">border</span>=<span style="color: #10CFC0;">"1"</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 200px; border-collapse: collapse; table-layout: fixed;"</span>&gt;
      &lt;<span style="color: #ECA964;">tr</span>&gt;
        &lt;<span style="color: #ECA964;">td</span>&gt;world&lt;/<span style="color: #ECA964;">td</span>&gt;
        &lt;<span style="color: #ECA964;">td</span>&gt;~&lt;/<span style="color: #ECA964;">td</span>&gt;
      &lt;/<span style="color: #ECA964;">tr</span>&gt;
    &lt;/<span style="color: #ECA964;">table</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8abe663" class="outline-2">
<h2 id="org8abe663">背景</h2>
<div class="outline-text-2" id="text-org8abe663">
</div>
<div id="outline-container-org0989da9" class="outline-3">
<h3 id="org0989da9">背景颜色</h3>
<div class="outline-text-3" id="text-org0989da9">
<p>
<code>background-color</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#28155;&#21152;&#32972;&#26223;&#39068;&#33394; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 640px; height: 50px;</span>
<span style="color: #10CFC0;">                background-color: green;"</span>&gt;
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org23dc64d" class="outline-3">
<h3 id="org23dc64d">背景图片</h3>
<div class="outline-text-3" id="text-org23dc64d">
<p>
<code>background-image</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#28155;&#21152;&#32972;&#26223;&#22270;&#29255; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 640px; height: 452px;</span>
<span style="color: #10CFC0;">                background-image: url(https://www.jmjc.tech/public/home/img/fly.jpg);"</span>&gt;
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org6f0de40" class="outline-3">
<h3 id="org6f0de40">重复背景图片</h3>
<div class="outline-text-3" id="text-org6f0de40">
<p>
<code>background-repeat</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#37325;&#22797;&#32972;&#26223;&#22270;&#29255; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">background-repeat: repeat-x &#27178;&#21521;&#37325;&#22797; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">background-repeat: repeat-y &#32437;&#21521;&#37325;&#22797; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">background-repeat: repeat &#37325;&#22797;&#30452;&#21040;&#22635;&#28385; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">background-repeat: no-repeat &#21462;&#28040;&#37325;&#22797; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 1000px; height: 1000px;</span>
<span style="color: #10CFC0;">                background-repeat: repeat;</span>
<span style="color: #10CFC0;">                background-image: url(https://www.jmjc.tech/public/home/img/fly.jpg);"</span>&gt;
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org7bdb2b8" class="outline-3">
<h3 id="org7bdb2b8">图片尺寸</h3>
<div class="outline-text-3" id="text-org7bdb2b8">
<p>
<code>background-size</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#22270;&#29255;&#23610;&#23544; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 640px; height: 452px;</span>
<span style="color: #10CFC0;">                background-image: url(https://www.jmjc.tech/public/home/img/fly.jpg);</span>
<span style="color: #10CFC0;">                background-repeat: no-repeat;</span>
<span style="color: #10CFC0;">                background-size: 320px 226px;</span>
<span style="color: #10CFC0;">                border: 10px dashed red;"</span>&gt;
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org601b74e" class="outline-3">
<h3 id="org601b74e">图片位置</h3>
<div class="outline-text-3" id="text-org601b74e">
<p>
<code>background-position</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#22270;&#29255;&#20301;&#32622; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 640px; height: 452px;</span>
<span style="color: #10CFC0;">                background-color: green;</span>
<span style="color: #10CFC0;">                background-image: url(https://www.jmjc.tech/public/home/img/fly.jpg);</span>
<span style="color: #10CFC0;">                background-repeat: no-repeat;</span>
<span style="color: #10CFC0;">                background-size: 320px 226px;</span>
<span style="color: #10CFC0;">                border: 10px dashed red;</span>
<span style="color: #10CFC0;">                background-position: 50% 50%"</span>&gt;
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org05c7302" class="outline-3">
<h3 id="org05c7302">固定背景位置</h3>
<div class="outline-text-3" id="text-org05c7302">
<p>
固定背景后滚动条滚动背景图片不会随之移动。
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#22266;&#23450;&#32972;&#26223;&#20301;&#32622; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 640px; height: 452px;</span>
<span style="color: #10CFC0;">                background-color: green;</span>
<span style="color: #10CFC0;">                background-image: url(https://www.jmjc.tech/public/home/img/fly.jpg);</span>
<span style="color: #10CFC0;">                background-repeat: repeat;</span>
<span style="color: #10CFC0;">                background-size: 320px 226px;</span>
<span style="color: #10CFC0;">                border: 10px dashed red;</span>
<span style="color: #10CFC0;">                background-attachment: fixed;"</span>&gt;
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
