org/CSS3简明总结.org
** 简写background
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <!-- 简写background -->
         <div style="width: 640px; height: 452px;
                     background-color: green;
                     background: url(https://www.jmjc.tech/public/home/img/fly.jpg) no-repeat 50% 50%;
                     background-size: 320px 226px;
                     border: 10px dashed red;">
         </div>
       </body>
     </html>
   #+end_src
* 效果
** 透明
   ~opacity~
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <!-- 透明 -->
         <div style="opacity: 0.3; background: #ff6138;
                     width: 100px; height: 100px;"></div>
         <div style="opacity: 0.7; background: #ff6138;
                     width: 100px; height: 100px;"></div>
       </body>
     </html>
   #+end_src
** 渐变
   ~background-image: linear-gradient(方向 COLOR1 COLOR2 COLOR3)~
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <!-- 渐变 -->
         <!-- linear-gradient参数-->
         <!-- to right/top/top right/bottom/bottom left/lef/top left color1 color2 color3-->
         <div style="width: 640px; height: 100px;
                     background-image: linear-gradient(to right, red, green, blue);">
         </div>
       </body>
     </html>
   #+end_src
** 变形
   ~transform~
   #+begin_src html
     <html>
       <style type="text/css">
       </style>
       <body>
         <!-- 变形 -->
         <!-- transform参数 -->
         <!-- 倾斜 | skew(水平角度, 垂直角度) -->
         <!-- 平移 | translate(水平方向, 垂直方向) -->
         <!-- 缩放 | scale(水平倍数, 垂直倍数) -->
         <!-- 旋转 | rotate(旋转角度) -->
         <!-- 作用点 | transform-origin{单独的属性}: left/cent/right % -->
         <div style="width: 100px; height: 100px;
                     margin: 100px;
                     background: red;
                     transform: rotate(45deg);">
         </div>
       </body>
     </html>
   #+end_src
** 动画
   ~animation~
   #+begin_src html
     <html>
       <style type="text/css">
         #animation{
             width: 100px;
             height: 100px;
             background: green;
         }
         /* 当鼠标放在此对象上 */
         #animation:hover{
             animation: ani 2s ease 3 0s;
         }
         /* 动画帧 | 0% ~ 100% 是动画生命周期的动作 */
         @keyframes ani {
             0% {
                 margin-left: 0px;
             }
             50% {
                 margin-left: 200px;
             }
             100% {
                 margin-left: 0px;
             }
         }
       </style>
       <body>
         <!-- 动画 -->
         <div id="animation"></div>
       </body>
     </html>
   #+end_src
* 浮动
  
