CSS3简明总结.html
<div id="outline-container-org7f3a5f5" class="outline-3">
<h3 id="org7f3a5f5">简写background</h3>
<div class="outline-text-3" id="text-org7f3a5f5">
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#31616;&#20889;background </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 640px; height: 452px;</span>
<span style="color: #10CFC0;">                background-color: green;</span>
<span style="color: #10CFC0;">                background: url(https://www.jmjc.tech/public/home/img/fly.jpg) no-repeat 50% 50%;</span>
<span style="color: #10CFC0;">                background-size: 320px 226px;</span>
<span style="color: #10CFC0;">                border: 10px dashed red;"</span>&gt;
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5ab0143" class="outline-2">
<h2 id="org5ab0143">效果</h2>
<div class="outline-text-2" id="text-org5ab0143">
</div>
<div id="outline-container-org7e18587" class="outline-3">
<h3 id="org7e18587">透明</h3>
<div class="outline-text-3" id="text-org7e18587">
<p>
<code>opacity</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#36879;&#26126; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"opacity: 0.3; background: #ff6138;</span>
<span style="color: #10CFC0;">                width: 100px; height: 100px;"</span>&gt;&lt;/<span style="color: #ECA964;">div</span>&gt;
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"opacity: 0.7; background: #ff6138;</span>
<span style="color: #10CFC0;">                width: 100px; height: 100px;"</span>&gt;&lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org3397471" class="outline-3">
<h3 id="org3397471">渐变</h3>
<div class="outline-text-3" id="text-org3397471">
<p>
<code>background-image: linear-gradient(方向 COLOR1 COLOR2 COLOR3)</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#28176;&#21464; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">linear-gradient&#21442;&#25968;</span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">to right/top/top right/bottom/bottom left/lef/top left color1 color2 color3</span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 640px; height: 100px;</span>
<span style="color: #10CFC0;">                background-image: linear-gradient(to right, red, green, blue);"</span>&gt;
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org5161d18" class="outline-3">
<h3 id="org5161d18">变形</h3>
<div class="outline-text-3" id="text-org5161d18">
<p>
<code>transform</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#21464;&#24418; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">transform&#21442;&#25968; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#20542;&#26012; | skew(&#27700;&#24179;&#35282;&#24230;, &#22402;&#30452;&#35282;&#24230;) </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#24179;&#31227; | translate(&#27700;&#24179;&#26041;&#21521;, &#22402;&#30452;&#26041;&#21521;) </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#32553;&#25918; | scale(&#27700;&#24179;&#20493;&#25968;, &#22402;&#30452;&#20493;&#25968;) </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#26059;&#36716; | rotate(&#26059;&#36716;&#35282;&#24230;) </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#20316;&#29992;&#28857; | transform-origin{&#21333;&#29420;&#30340;&#23646;&#24615;}: left/cent/right % </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">style</span>=<span style="color: #10CFC0;">"width: 100px; height: 100px;</span>
<span style="color: #10CFC0;">                margin: 100px;</span>
<span style="color: #10CFC0;">                background: red;</span>
<span style="color: #10CFC0;">                transform: rotate(45deg);"</span>&gt;
    &lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf4b7ee7" class="outline-3">
<h3 id="orgf4b7ee7">动画</h3>
<div class="outline-text-3" id="text-orgf4b7ee7">
<p>
<code>animation</code>
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #ECA964;">html</span>&gt;
  &lt;<span style="color: #ECA964;">style</span> <span style="color: #31C6FF;">type</span>=<span style="color: #10CFC0;">"text/css"</span>&gt;
    #animation{
        width: 100px;
        height: 100px;
        background: green;
    }
    /* &#24403;&#40736;&#26631;&#25918;&#22312;&#27492;&#23545;&#35937;&#19978; */
    #animation:hover{
        animation: ani 2s ease 3 0s;
    }
    /* &#21160;&#30011;&#24103; | 0% ~ 100% &#26159;&#21160;&#30011;&#29983;&#21629;&#21608;&#26399;&#30340;&#21160;&#20316; */
    @keyframes ani {
        0% {
            margin-left: 0px;
        }
        50% {
            margin-left: 200px;
        }
        100% {
            margin-left: 0px;
        }
    }
  &lt;/<span style="color: #ECA964;">style</span>&gt;
  &lt;<span style="color: #ECA964;">body</span>&gt;
    <span style="color: #6B7887; text-decoration: underline;">&lt;!-- </span><span style="color: #6B7887; text-decoration: underline;">&#21160;&#30011; </span><span style="color: #6B7887; text-decoration: underline;">--&gt;</span>
    &lt;<span style="color: #ECA964;">div</span> <span style="color: #31C6FF;">id</span>=<span style="color: #10CFC0;">"animation"</span>&gt;&lt;/<span style="color: #ECA964;">div</span>&gt;
  &lt;/<span style="color: #ECA964;">body</span>&gt;
&lt;/<span style="color: #ECA964;">html</span>&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0dc4497" class="outline-2">
<h2 id="org0dc4497">浮动</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-11-10 二 00:00</p>
<p class="author">Author: Evan Meek</p>
<p class="date">Created: 2020-11-12 四 01:56</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
